СкладГП/src/InformationRegisters/ОстаткиПакетовНаСкладах/ОстаткиПакетовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПакетовНаСкладах</name>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonForms/ФормаУстановкиПакетаВЯчейку/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНастройкиФормыПодЭкранКлиента();
	ПроверитьСвязь();
	Если ЗначениеЗаполнено(ВыбраннаяЯчейка) и ЕстьСвязь Тогда
		ЯчейкиСкладаКлиент.НачатьОбновлениеПакетовЯчейки(ВыбраннаяЯчейка, ЕстьСвязь);
	КонецЕсли;
	//НастроитьФорму();
	ЭлементПакетСВилНажатие(НЕОПРЕДЕЛЕНО);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыполненаАвторизацияКлиента" Тогда	
		
	ИначеЕсли ИмяСобытия = "ИзмененВидИнтерфейса" Тогда
		НастроитьТемуИнтерфейса();
		
	ИначеЕсли ИмяСобытия  = "ИзменениеРазмещенияПакета" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.Ячейка = ВыбраннаяЯчейка Тогда 
				НастроитьФорму();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбновлениеПакетовЯчейки" и Параметр = ВыбраннаяЯчейка Тогда
		
		НастроитьФорму()
		
	ИначеЕсли ИмяСобытия = "ИзменениеКачестваСвязи" Тогда
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоУровнейЯчейки = 5;
	
	НастроитьТемуИнтерфейса();
	
	Если Не ЗначениеЗаполнено(Параметры.Пакет) Тогда Отказ = ИСТИНА; Возврат КонецЕсли;
	ВыбраннаяЯчейка = Параметры.Ячейка;
	
	СвойстваПакета = Пакеты.СвойстваПакетаМоб(Параметры.Пакет);
	Если СвойстваПакета = Неопределено Тогда
		а=1;
	Иначе
		Пакет = Параметры.Пакет;
		НомерПакета = СвойстваПакета.Номер;
		
		ЯчейкиСклада.НастроитьДекорациюПакета(Элементы, Элементы.ЭлементПакетСВил, НомерПакета, 3, СтрШаблон("%1 %2", СвойстваПакета.Сечение, СвойстваПакета.Сорт));
		ЯчейкиСклада.НастроитьДекорациюПакета(Элементы, Элементы.ЭлементПакетСВил1, НомерПакета, 3, СтрШаблон("%1 %2", СвойстваПакета.Сечение, СвойстваПакета.Сорт));
		Если Не ЗначениеЗаполнено(Пакет2) Тогда
			Элементы.ЭлементПакетСВил1.Видимость = ЛОЖЬ;
		КонецЕсли;
		
		Элементы.ЭлементПакетСВил.УстановитьДействие("Нажатие",	"ЭлементПакетСВилНажатие");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура Подтвердить(Команда)
	НачатьПомещениеПакетаВЯчейку()	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НачатьПомещениеПакетаВЯчейку()
	ПомещениеПакетаВЯчейкуНаСервере();
	Оповестить("ИзменениеРазмещенияПакета",  Новый Структура("Ячейка,Пакет", ВыбраннаяЯчейка, Пакет));
	ЭтаФорма.Закрыть(Пакет);	
КонецПроцедуры

&НаСервере
Процедура ПомещениеПакетаВЯчейкуНаСервере()
	
	//РегистрыСведений.Удалить_ИзмененияЯчеекСклада.ДобавитьИзмененияПакета(Пакет, ВыбраннаяЯчейка, Ряд, Уровень);
	РегистрыСведений.ОстаткиПакетовНаСкладах.ИзменитьРасположениеПакета(Пакет, ВыбраннаяЯчейка, Ряд, Уровень);
	
	//СлужебныйОбновлениеВызовСервера.НачатьОбменФоново(10);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТемуИнтерфейса()
	СтилиФорм.НастроитьТемуИнтерфейса(ЭтотОбъект)	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСвязь() Экспорт
	ЕстьСвязь = http_Клиент.ЕстьСвязь();
КонецПроцедуры

&НаСервере
Функция ОпределитьСледующийУровеньРядаЯчейки(ВыбраннаяЯчейка, Ряд)
	ОстаткиЯчейки = ЯчейкиСкладаВызовСервера.ПолучитьОстаткиЯчейки(ВыбраннаяЯчейка);
	ОстаткиРяда = ОстаткиЯчейки.Скопировать(Новый Структура("Ряд", Ряд));
	Возврат ОстаткиРяда.Количество()+1;
КонецФункции

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	КоличествоУровнейЯчейки = 5;
	ЯчейкиСкладаКлиент.НачатьОбновлениеПакетовЯчейки(ВыбраннаяЯчейка, ЕстьСвязь);
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Асинх Процедура СброситьСВил(Команда)
	
	ТекстВопроса = "Убрать пакет "+НомерПакета+" с вил?";
	РезультатОтвета = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Закрыть(Пакет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РядПриИзменении(Элемент)
	НовыйУровень = ОпределитьСледующийУровеньРядаЯчейки(ВыбраннаяЯчейка, Ряд);
	Уровень = НовыйУровень;
КонецПроцедуры

&НаКлиенте
Процедура УровеньПриИзменении(Элемент)
	Отказ = ЛОЖЬ;
	ПроверитьРазмещенияПакетаПоАдресу(Отказ);
	Если Отказ Тогда 
		Сообщить("Данное место занято, выберите другое");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРазмещенияПакетаПоАдресу(Отказ)
	ОстаткиЯчейки = ЯчейкиСкладаВызовСервера.ПолучитьОстаткиЯчейки(ВыбраннаяЯчейка);
	ОстаткиРяда = ОстаткиЯчейки.Скопировать(Новый Структура("Ряд,Уровень", Ряд, Уровень));
	Если ОстаткиРяда.Количество() = 0 Тогда
		Отказ = ЛОЖЬ;
	Иначе
		Отказ = НЕ ОстаткиРяда[0].ПакетID = Пакет
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура НовыйРяд(Команда)
	РезультатОтвета = Ждать ВопросАсинх("Добавить новый ряд?", РежимДиалогаВопрос.ДаНет);
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		НачатьДобавлениеНовогоРяда();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьДобавлениеНовогоРяда(Слева = ИСТИНА)
	ДобавитьНовыйРядНаСервере(Слева);
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйРядНаСервере(Слева = ИСТИНА)
	ЯчейкиСклада.ДобавитьРядНаСервере(ВыбраннаяЯчейка, РядыЯчейки, 1, КоличествоУровнейЯчейки, Слева);
	ЯчейкиСклада.ВывестиПредставлениеШтабеляНаФорму(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(ЗаполнятьОстаткиШтабеля = ИСТИНА)
	Если ЗаполнятьОстаткиШтабеля Тогда
		ЯчейкиСклада.ЗаполнитьТаблицуРядыЯчейки(ЭтотОбъект, ВыбраннаяЯчейка);
	КонецЕсли;
	ЯчейкиСклада.ВывестиПредставлениеШтабеляНаФорму(ЭтотОбъект, ШиринаЭкрана, ОбратнаяОриентация);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиФормыПодЭкранКлиента()
	ОбщегоНазначенияКлиент.ЗаполнитьСвойстваФормыПриИзмененииПараметровЭкрана(ЭтаФорма);
	Если ГоризонтальноеПоложениеЭкрана Тогда
		ГоризонтальноПакетовНаФорме = 5;	
	Иначе
		ГоризонтальноПакетовНаФорме = 2;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбновитьНастройкиФормыПодЭкранКлиента();
	НастроитьФорму(ЛОЖЬ);
КонецПроцедуры

&НаКлиенте
Процедура Ячейка_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ДействиеПослеЗакрытияВыбораШтабеля = Новый ОписаниеОповещения("ДействиеПослеЗакрытияВыбораШтабеля", ЭтотОбъект);
	ОткрытьФорму("Справочник.Ячейки.Форма.ФормаВыбораСектора", Новый Структура("ВыбраныйШтабель", ВыбраннаяЯчейка), ЭтаФорма,,,,ДействиеПослеЗакрытияВыбораШтабеля)
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПослеЗакрытияВыбораШтабеля(Результат, ДопПар) ЭКспорт
	Если Результат = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	ВыбраннаяЯчейка = Результат;
	ЯчейкаПриИзменении("")
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(э_ВыбранныйЭлементИмя) и ЗначениеЗаполнено(э_ВыбранныйПакет) Тогда
		
		СтрокаОписанияТекЯчейки = ЯчейкиСкладаКлиент.ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Элемент.Имя, РядыЯчейки);
		Если НЕ СтрокаОписанияТекЯчейки = НЕОПРЕДЕЛЕНО Тогда
			Если Не ЗначениеЗаполнено(СтрокаОписанияТекЯчейки.Пакет) Тогда
				
				ЯчейкиСкладаКлиент.РазместитьПакетВЯчейкеКлиент(э_ВыбранныйПакетID, ВыбраннаяЯчейка, СтрокаОписанияТекЯчейки.Ряд, СтрокаОписанияТекЯчейки.Уровень, ИСТИНА);	
				
			КонецЕсли;
		КонецЕсли;
		
		Если э_ВыбранныйЭлементИмя = "ЭлементПакетСВил" Тогда
			ЭтаФорма.Закрыть(Пакет);
		Иначе
			ОбщегоНазначенияКлиент.УстановитьСтилиДекорации(Элементы, Элементы[э_ВыбранныйЭлементИмя], ЯчейкиСкладаКлиент.СтильДекорацииОбычныйПакет());
			э_ВыбранныйЭлементИмя = "";
			э_ВыбранныйПакет = Неопределено;	
		КонецЕсли;
		
	Иначе
		
		СтрокаОписанияТекЯчейки = ЯчейкиСкладаКлиент.ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(Элемент.Имя, РядыЯчейки);	
		
		Если НЕ СтрокаОписанияТекЯчейки = НЕОПРЕДЕЛЕНО Тогда
			Если ЗначениеЗаполнено(СтрокаОписанияТекЯчейки.Пакет) Тогда
				э_ВыбранныйЭлементИмя = Элемент.Имя;
				э_ВыбранныйПакет = СтрокаОписанияТекЯчейки.Пакет;
				э_ВыбранныйПакетID = СтрокаОписанияТекЯчейки.ПакетID;
				
				ОбщегоНазначенияКлиент.УстановитьСтилиДекорации(Элементы, Элемент, ЯчейкиСкладаКлиент.СтильДекорацииВыделенныйПакет());
			Иначе
				ЯчейкиСкладаКлиент.ОткрытьФормуВыбораПакетаДляЭлементаШтабеля(ЭтаФорма, ВыбраннаяЯчейка, Элемент, РядыЯчейки);
				//Открыть сразу форму
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПакетСВилНажатие(Команда)
	Если э_ВыбранныйПакетID = Пакет Тогда
		ОбщегоНазначенияКлиент.УстановитьСтилиДекорации(Элементы, Элементы.ЭлементПакетСВил, ЯчейкиСкладаКлиент.СтильДекорацииОбычныйПакет());
		э_ВыбранныйПакетID = Неопределено;
		э_ВыбранныйЭлементИмя = "";
		э_ВыбранныйПакет = "";
	Иначе
		ОбщегоНазначенияКлиент.УстановитьСтилиДекорации(Элементы, Элементы.ЭлементПакетСВил, ЯчейкиСкладаКлиент.СтильДекорацииВыделенныйПакет());
		э_ВыбранныйПакетID = Пакет;
		э_ВыбранныйЭлементИмя = "ЭлементПакетСВил";
		э_ВыбранныйПакет = "НомерПакета";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДействияПакета(ЭлементПакета, ПакетВЯчейке, СтрокаТаблицы) Экспорт
	
	ЭлементПакета.УстановитьДействие("Нажатие",	"ПакетНажатие");
	УстановитьКонтекстноеМенюПакета(ЭлементПакета, СтрокаТаблицы) 	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКонтекстноеМенюПакета(ЭлементПакета, СтрокаТаблицы) Экспорт
	Если ЗначениеЗаполнено(СтрокаТаблицы.Пакет) Тогда 
		ЯчейкиСклада.ДобавитьКомандуКонтекстногоМеню(ЭтаФорма, Элементы, ЭлементПакета, "_ЗабратьПакет", "ЗабратьПакетИзЯчейки");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗабратьПакетИзЯчейки(Команда)
	ЭлементКартинки = ЯчейкиСкладаКлиент.ПолучитьЭлементКартинкиПоКоманде(ЭтотОбъект, Элементы, Команда);
	СтрокаОписания = ЯчейкиСкладаКлиент.ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(ЭлементКартинки.Имя, РядыЯчейки);
	ЗадатьВопросУдалитьПакетИзЯчейки(ЭлементКартинки, СтрокаОписания);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросУдалитьПакетИзЯчейки(ЭлементКартинки, СтрокаОписания)
	ТекстВопроса = СтрШаблон("Удалить пакет %1 из ячейки?", СтрокаОписания.Пакет);
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьПакетИзЯчейки(ЭлементКартинки, СтрокаОписания);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьПакетИзЯчейки(ЭлементКартинки, СтрокаОписания)
	
	ЯчейкиСкладаКлиент.РазместитьПакетВЯчейкеКлиент(СтрокаОписания.ПакетID, ВыбраннаяЯчейка, 0, 0, ЛОЖЬ);
	
	СтрокиРяда = РядыЯчейки.НайтиСтроки(Новый Структура("Ряд", СтрокаОписания.Ряд)); 
	Для Каждого стр из СтрокиРяда Цикл
		Если стр.Уровень > СтрокаОписания.Уровень и ЗначениеЗаполнено(стр.Пакет) Тогда 
			//Смещаем на уровень вниз
			Ждать ЯчейкиСкладаКлиент.РазместитьПакетВЯчейкеКлиент(стр.ПакетID, ВыбраннаяЯчейка, 0, 0, ЛОЖЬ);	
		КонецЕсли;	
	КонецЦикла;
	
	Оповестить("ИзменениеРазмещенияПакета", Новый Структура("Пакет, Ячейка, Ряд, Уровень", стр.Пакет, ВыбраннаяЯчейка, стр.Ряд, стр.Уровень-1));
	
КонецПроцедуры

&НаСервере
Функция суффиксыДобавленныхКоманд() ЭКспорт
	суффиксы = Новый Структура();
	суффиксы.Вставить("_ЗабратьПакет",			 "Забрать пакет");
	Возврат суффиксы;
КонецФункции

&НаКлиенте
Асинх Процедура НовыйРядСправа(Команда)
	РезультатОтвета = Ждать ВопросАсинх("Добавить новый ряд справа?", РежимДиалогаВопрос.ДаНет);
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		НачатьДобавлениеНовогоРяда(ЛОЖЬ);	
	КонецЕсли;
	Если Элементы.СтраницыРядов.ПодчиненныеЭлементы.Количество() > 0 Тогда
		Элементы.СтраницыРядов.ТекущаяСтраница = Элементы.СтраницыРядов.ПодчиненныеЭлементы[Элементы.СтраницыРядов.ПодчиненныеЭлементы.Количество()-1];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЯчейка_Стиль1Нажатие(Элемент)
	Сообщить("лвыоадыо");
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьОриентациюНастроитьКнопку()
	Элементы.ПоменятьОриентацию.Картинка = ?(ОбратнаяОриентация, БиблиотекаКартинок.Обратный, БиблиотекаКартинок.Прямой);
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьОриентацию(Команда)
	ОбратнаяОриентация = НЕ ОбратнаяОриентация;
	ПоменятьОриентациюНастроитьКнопку();
	НастроитьФорму();
КонецПроцедуры
